"""В одній країні використовуються грошові купюри номіналом в 1, 2,
4, 8, 16, 32 і 64. Дано натуральне число n. Якою найменшою
кількістю таких грошових знаків можна виплатити суму n (вказати
кількість кожної з використовуваних для виплати купюр)?
Передбачається, що є досить велика кількість купюр всіх номіналів."""

#Створення зміної для зьереження списку
cash = [64, 32, 16, 8, 4, 2, 1]
#Створення зміної для збереження цілочисельного значення суми грошей
n = int(input("Введіть суму грошей: "))
#Створення ще одного списку для збереження пустого
#спику для запису результатів
result = []
#Створення циклу
for i in cash:
    #Створення циклу з після умовою
    while n >= i:
        #Команда для запису в список Результат елементу (і) при виконанні умови
        result.append(i)
        #Зменшення на і-число нашого введеного числа
        n -= i
#Виведення результатів в консоль
print(f"Сума {n} може бути виплачена таким чином: {result}")